Revit 2027 API
Element.EvaluateParameterValues Method
 Evaluate the parameters' values of the element on the given parameter ID set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<EvaluatedParameter> EvaluateParameterValues(
	ISet<ElementId> parameterIds
)
Public Function EvaluateParameterValues (
	parameterIds As ISet(Of ElementId)
) As IList(Of EvaluatedParameter)
public:
IList<EvaluatedParameter^>^ EvaluateParameterValues(
	ISet<ElementId^>^ parameterIds
)
member EvaluateParameterValues :
        parameterIds : ISet<ElementId> -> IList<EvaluatedParameter>
Parameters
parameterIds ISet<ElementId>
 Parameter IDs with which the ParameterValue to be retrieved.
Return Value
IList<EvaluatedParameter>
 List of EvaluatedParameter of the element, which does not include those that cannot be retrieved but are passed in through parameterIds.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace